In [2]:
import pandas as pd
df = pd.read_csv("Population_other.csv", sep=";", encoding="utf-8-sig")
df.head()

   Countyfips StateCode    State  Year  Total Population
0           0        AL  Alabama  1990           4050055
1           0        AL  Alabama  1991           4099156
2           0        AL  Alabama  1992           4154014
3           0        AL  Alabama  1993           4214202
4           0        AL  Alabama  1994           4260229

In [3]:
df = df.drop(columns=['Countyfips'])
df.head()

  StateCode    State  Year  Total Population
0        AL  Alabama  1990           4050055
1        AL  Alabama  1991           4099156
2        AL  Alabama  1992           4154014
3        AL  Alabama  1993           4214202
4        AL  Alabama  1994           4260229

In [4]:
df.to_csv("Population_total.csv", sep=';', index=False)

In [5]:
df.dtypes

StateCode           object
State               object
Year                 int64
Total Population     int64
dtype: object

In [6]:
df.columns

Index(['StateCode', 'State', 'Year', 'Total Population'], dtype='object')

In [7]:
df = df.rename(columns={"Total Population": "Population"})
df.head()

  StateCode    State  Year  Population
0        AL  Alabama  1990     4050055
1        AL  Alabama  1991     4099156
2        AL  Alabama  1992     4154014
3        AL  Alabama  1993     4214202
4        AL  Alabama  1994     4260229

In [8]:
df.to_csv("Population_total.csv", sep=';', index=False)